---
kind: method
id: M:Autodesk.Revit.DB.ElementArray.GetEnumerator
source: html/84518dca-32a4-9146-4628-5656b411c121.htm
---
# Autodesk.Revit.DB.ElementArray.GetEnumerator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the array.